nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso55s36/azure_rtos_examples/i2c_example/pin_mux.h
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief Selects pin function 1 */
#define IOCON_PIO_FUNC1 0x01u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief Select Digital mode: Enable Digital mode. Digital input is enabled. */
#define PIO1_21_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Mode select (on-chip pull-up/pull-down resistor control): Pull-up. Pull-up resistor enabled. */
#define PIO1_21_MODE_PULL_UP 0x02u
/*!
 * @brief Controls open-drain mode: Open-drain. Simulated open-drain output (high drive disabled). */
#define PIO1_21_OD_OPEN_DRAIN 0x01u
/*!
 * @brief Select Digital mode: Enable Digital mode. Digital input is enabled. */
#define PIO1_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Mode select (on-chip pull-up/pull-down resistor control): Pull-up. Pull-up resistor enabled. */
#define PIO1_24_MODE_PULL_UP 0x02u
/*!
 * @brief Controls open-drain mode: Open-drain. Simulated open-drain output (high drive disabled). */
#define PIO1_24_OD_OPEN_DRAIN 0x01u
/*!
 * @brief Select Digital mode: Enable Digital mode. Digital input is enabled. */
#define PIO1_25_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Mode select (on-chip pull-up/pull-down resistor control): Pull-up. Pull-up resistor enabled. */
#define PIO1_25_MODE_PULL_UP 0x02u
/*!
 * @brief Controls open-drain mode: Open-drain. Simulated open-drain output (high drive disabled). */
#define PIO1_25_OD_OPEN_DRAIN 0x01u
/*!
 * @brief Select Digital mode: Enable Digital mode. Digital input is enabled. */
#define PIO1_30_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Mode select (on-chip pull-up/pull-down resistor control): Pull-up. Pull-up resistor enabled. */
#define PIO1_30_MODE_PULL_UP 0x02u
/*!
 * @brief Controls open-drain mode: Open-drain. Simulated open-drain output (high drive disabled). */
#define PIO1_30_OD_OPEN_DRAIN 0x01u

/*! @name FC0_RXD_SDA_MOSI_DATA (number 93), JP78[2]/P0_29-FC0_RXD_SDA_MOSI_DATA-TRACED2
  @{ */
/* @} */

/*! @name FC0_TXD_SCL_MISO_WS (number 95), JP49[3]/JP80[2]/P0_30-FC0_TXD_SCL_MISO_WS-TRACED1-CAN0_TD
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
